SPedt_!/src/Enums/СтатусыДоставки/СтатусыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоставки</name>
  <enumValues>
    <name>ОжидаетСборки</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
</mdclass:Enum>

SPedt_!/src/Documents/КурьерскаяДоставка/КурьерскаяДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КурьерскаяДоставка</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>AccumulationRegister.СобранныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСбора</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыГруппыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьОплачиваетОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СобранныйЗаказ</name>
    <type>
      <types>CatalogRef.СобранныеЗаказы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоставки</name>
    <type>
      <types>EnumRef.СтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВыставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленаОтмена</name>
    <comment>Выполнен запрос удаления из группы отмененных заказов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойКурьер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленаВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоставкаОтменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаОтмены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыСПосылками</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыНаСкладе</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияПоступления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/Catalogs/ПараметрыОбмена/ПараметрыОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыОбмена</name>
  <predefined>
    <items>
      <name>Возвраты</name>
      <description>Возвраты разрешенные</description>
    </items>
    <items>
      <name>ГрафикиРаботы</name>
      <description>Графики работы</description>
    </items>
    <items>
      <name>ГруппыДоставки</name>
      <description>Группы доставки</description>
    </items>
    <items>
      <name>КартыУчастников</name>
      <description>Карты участников</description>
    </items>
    <items>
      <name>КурьерскаяДоставка</name>
      <description>Курьерская доставка</description>
    </items>
    <items>
      <name>Обмен_Incjome</name>
      <description>Обмен incjome</description>
    </items>
    <items>
      <name>Покупки</name>
      <description>Покупки</description>
    </items>
    <items>
      <name>ПокупкиВПутиОтчет</name>
      <description>Покупки в пути (отчет)</description>
    </items>
    <items>
      <name>Посылки</name>
      <description>Посылки</description>
    </items>
    <items>
      <name>ПраваВозвраты</name>
      <description>Права возвраты</description>
    </items>
    <items>
      <name>Супергруппы</name>
      <description>Супергруппы</description>
    </items>
    <items>
      <name>Участники</name>
      <description>Участники</description>
    </items>
    <items>
      <name>ЧасовойПояс</name>
      <description>Часовой пояс</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SPedt_!/src/CommonModules/СП_КурьерскаяДоставка/Module.bsl
#Область Синхронизация

Функция Получить_ПоДате(ДатаЗагрузки	= неопределено) Экспорт
	Если ДатаЗагрузки	= неопределено Тогда
		если не ЗначениеЗаполнено(Справочники.ПараметрыОбмена.КурьерскаяДоставка) Тогда
			ДатаЗагрузки =  Справочники.ПараметрыОбмена.ГруппыДоставки.ДатаЗагрузки - 60*24*60*10;
		Иначе	
			ДатаЗагрузки =  Справочники.ПараметрыОбмена.КурьерскаяДоставка.ДатаЗагрузки - 60*24*60*10;
		КонецЕсли;	
	КонецЕсли;	
	хмл_отправили 		= СтоСПОбмен_Запрос.ГруппаДоставки_ПоДате(ДатаЗагрузки);
	хмл_получили 		= ПолученныеДанные(хмл_отправили);
	
	результатРазбора 	= Разбор_Доставки(хмл_получили);
	

	Если результатРазбора.АвторизацияВыполнена Тогда
		
		массивТипов = новый Массив();
		массивТипов.Добавить("СправочникСсылка.Коробки");
		массивТипов.Добавить("ДокументСсылка.КурьерскаяДостаука");
		
		кол = результатРазбора.deliveryGroups.Колонки.Добавить("Ссылка",Новый ОписаниеТипов(массивТипов));
		Обновить_Доставки_ПоКодуДате(результатРазбора.deliveryGroups);
		СтоСПОбмен_Общий.УстановитьДатуЗагрузки(Справочники.ПараметрыОбмена.КурьерскаяДоставка);
	Конецесли;
	
	массГрупп			= результатРазбора.deliveryGroups.ВыгрузитьКолонку("Ссылка");
	
	Возврат массГрупп;
КонецФункции



Функция Загрузить_ПоКодам(КодыГрупп, Интерактивно = Ложь) Экспорт
	Если КодыГрупп.Количество()=0 Тогда Возврат Ложь; КонецЕсли;
	хмл_отправили 	= СтоСПОбмен_Запрос.ГруппаДоставки_ПоКодам(КодыГрупп);
	хмл_получили 	= ПолученныеДанные(хмл_отправили);
	//хмл_получили 	= СтрЗаменить(хмл_получили,"waitForDistributor", "waitForOrders");
	
	результатРазбора = Разбор_Доставки(хмл_получили);
	Если результатРазбора.АвторизацияВыполнена и Интерактивно = Ложь Тогда
		кол = результатРазбора.deliveryGroups.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("СправочникСсылка.Коробки"));
		Обновить_Доставки_ПоКодуДате(результатРазбора.deliveryGroups);
	Конецесли;	
	Возврат результатРазбора;
	
КонецФункции

Процедура ПолучитьДоставкиСпризнаком_Догрузить() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурьерскаяДоставка.Номер КАК Код
		|ИЗ
		|	Документ.КурьерскаяДоставка КАК КурьерскаяДоставка
		|ГДЕ
		|	КурьерскаяДоставка.Догрузить";
	

	
	РезультатЗапроса = Запрос.Выполнить();
	СписокКодов = новый СписокЗначений;
	СписокКодов.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Код"));
	
	Загрузить_ПоКодам(СписокКодов);
КонецПроцедуры




Процедура Обновить_Доставки_ПоКодуДате(тзГрупп) Экспорт 
	Ошибки		= Неопределено;
	Для каждого стр из тзГрупп Цикл
		Если стр.result="error" Тогда
			ТекстОшибки 	= "При получении с сайта курьерской Доставки  №"+стр.id+" возникли ошибка:";
			Если стр.message	<> "" Тогда
				ТекстОшибки	= ТекстОшибки + Символы.ПС + стр.message+";";
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"",ТекстОшибки,);
			КонецЕсли
		Иначе	
			Если стр.recipient_code = "100"	 Тогда //Курьерская доставка
				СП_КурьерскаяДоставка.ДокументКурьерскойДоставки_из_Api(стр);
			КонецЕсли	
		КонецЕсли;
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
КонецПроцедуры	

#КонецОбласти


Функция ДокументКурьерскойДоставки_из_Api(стр, документДоставки = неопределено) экспорт
	
	Если документДоставки = Неопределено Тогда
		документНайден		= Документы.КурьерскаяДоставка.НайтиПоНомеру(стр.id);
		Если ЗначениеЗаполнено(документНайден) Тогда
			документДоставки = документНайден.ПолучитьОбъект();
		Иначе
			документДоставки 				= Документы.КурьерскаяДоставка.СоздатьДокумент();
			документДоставки.Номер			= стр.id;
			документДоставки.Дата			= ТекущаяДата();
			документДоставки.СвойКурьер 	= Константы.СвойКурьер.Получить();
		КонецЕсли;

	КонецЕсли;
	Если 	ЗначениеЗаполнено(ДокументДоставки.СтатусДоставки) и 
			ДокументДоставки.СтатусДоставки <> Перечисления.СтатусыДоставки.ОжидаетСборки Тогда 	
			стр.Ссылка	= документДоставки.Ссылка;
			Возврат документДоставки.Ссылка;
	КонецЕсли;

	документДоставки.ТочкаСбора					= СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(стр.distributor_code);
	документДоставки.Статус						= Перечисления.СтатусыГруппыДоставки[стр.status];
	документДоставки.Участник					= СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(стр.uid);
	документДоставки.МинимальнаяДатаДоставки	= СтоСПОбмен_Общий.ДатаИзСтроки(стр.min_delivery_date);
	документДоставки.МаксимальнаяДатаДоставки	= СтоСПОбмен_Общий.ДатаИзСтроки(стр.max_delivery_date);
	документДоставки.СрокХраненияГруппы			= Число(?(стр.date_range_limit="",0,стр.date_range_limit));
	документДоставки.ДатаСоздания				= СтоСПОбмен_Общий.ДатаИзСтроки(стр.created_at);
	документДоставки.ДатаМодификации			= СтоСПОбмен_Общий.ДатаИзСтроки(стр.updated_at);
	документДоставки.МетодОплаты				= ?(стр.payment_method = "",Перечисления.МетодыОплаты.ПустаяСсылка(),Перечисления.МетодыОплаты[стр.payment_method]);
	документДоставки.СтатусДоставки 			= Перечисления.СтатусыДоставки.ОжидаетСборки;
	
	

	ДокументДоставки.Заказы.Очистить();
	для каждого заказ из стр.orders.order Цикл
		новыйЗаказ		= ДокументДоставки.Заказы.Добавить();
		новыйЗаказ.КодЗаказа 				= заказ.orderId;
		новыйЗаказ.Покупка					= СП_РаботаСоСправочниками.ПолучитьЗаказПоXDTO(заказ,"orderType");
		новыйЗаказ.ОбъявленнаяСтоимость		= заказ.payment_sum;
		Если заказ.packages <> Неопределено Тогда
			Для Каждого посылка Из заказ.packages.package Цикл
				ЗаказСПосылкой = ДокументДоставки.ЗаказыСПосылками.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаказСПосылкой, новыйЗаказ);
				ЗаказСПосылкой.Посылка	= СП_РаботаСоСправочниками.ПолучитьПосылкуПо_Коду(Посылка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	//	ТочкаНазначения		= СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(стр.recipient_code);

	ДокументДоставки.Догрузить = (ДокументДоставки.ЗаказыСПосылками.Количество()=0);
	
	Попытка
			документДоставки.Записать();
			стр.Ссылка	= документДоставки.Ссылка;
		Возврат документДоставки.Ссылка;
	Исключение
		ТекстСообщения = "Не удалось создать документ Курьерской доставки №"+стр.id+Символы.ПС+
						ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	

	Возврат Неопределено;			
	
КонецФункции



#Область УдалитьЗаказыИзГруппы
Процедура УдалитьЗаказыИзГруппы(ДокументКД) Экспорт
	ЕстьЗаказыКОтмене = ДокументКД.Заказы.НайтиСтроки(новый Структура("ДоставкаОтменена",Истина)).Количество()>0;
	Если ЕстьЗаказыКОтмене и не ДокументКД.ОтправленаОтмена Тогда
		Отправили 			= ТекстЗапроса_УдалитьЗаказыИзГруппы(ДокументКД);
		Получили			= ОтправитьНаСайт(Отправили, ДокументКД.Ссылка,"Удаление заказов из группы");
		АнализОтвета		= АнализОтвета_УдаленияЗаказовИзГруппы(Получили.ПолученныеДанные);
		Если не АнализОтвета.авторизацияВыполнена Тогда Возврат; КонецЕсли;
		Для Каждого элем из АнализОтвета.groupsUnlink Цикл
			найденыеЗаказы = ДокументКД.Заказы.НайтиСтроки(новый Структура("КодЗаказа",элем.orderId));
			Для каждого Заказ из найденыеЗаказы Цикл
				Если Элем.result = "error" Тогда
					Заказ.ОшибкаОтмены 	= Истина;
					Заказ.Сообщение		= Элем.message; 
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ДокументКД.ОтправленаОтмена = Истина;
	КонецЕсли;
КонецПроцедуры	

Функция ТекстЗапроса_УдалитьЗаказыИзГруппы(ДокументКД) 
	ЗаписьXML=Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьНачалоЭлемента("distributors");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd", "http://www.w3.org/2001/XMLSchema");

	СписокЗаказовКОтмене	= ДокументКД.Заказы.НайтиСтроки(Новый Структура("ДоставкаОтменена", Истина ));
	
	 Для каждого стр из СписокЗаказовКОтмене Цикл 
		 ЗаписьXML.ЗаписатьНачалоЭлемента("groupsUnlink");
			 ЗаписьXML.ЗаписатьНачалоЭлемента("group");
			 
					 ЗаписьXML.ЗаписатьНачалоЭлемента("delivery_group_id");
					 	ЗаписьXML.ЗаписатьТекст(ДокументКД.Номер);
					 ЗаписьXML.ЗаписатьКонецЭлемента();
					 
					 ЗаписьXML.ЗаписатьНачалоЭлемента("orderType");
						ЗаписьXML.ЗаписатьТекст("sp");
					 ЗаписьXML.ЗаписатьКонецЭлемента();
					 
					ЗаписьXML.ЗаписатьНачалоЭлемента("orderId");
						ЗаписьXML.ЗаписатьТекст(Формат(стр.КодЗаказа, "ЧГ=0"));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					 
					 ЗаписьXML.ЗаписатьНачалоЭлемента("uid");
					 	ЗаписьXML.ЗаписатьТекст(Формат(ДокументКД.Участник.Код,"ЧГ=0"));
					 ЗаписьXML.ЗаписатьКонецЭлемента();
					 
					 
			 
			 ЗаписьXML.ЗаписатьКонецЭлемента();
		 ЗаписьXML.ЗаписатьКонецЭлемента();		 
		 
	 КонецЦикла;





	ЗаписьXML.ЗаписатьКонецЭлемента();
	ОтправленныеДанные = ЗаписьXML.Закрыть();
	ОтправленныеДанные = СтрЗаменить(ОтправленныеДанные, "xmlns=""http://www.100sp.ru/XMLSchema-instance"" ", "");
	Возврат ОтправленныеДанные;
КонецФункции

Функция АнализОтвета_УдаленияЗаказовИзГруппы(ПолученныеДанные)
	стр_Результат			= Новый Структура;

	пространствоИмен		= "http://www.100sp.ru/api/distributor/upload/back";
	авторизацияВыполнена	= ложь;
	Тип_distributors		= ФабрикаXDTO.Тип(пространствоИмен, "distributors");
		
	ПолученныеДанные		= СтрЗаменить(ПолученныеДанные, "http://www.100sp.ru","http://www.100sp.ru/api/distributor/upload/back");
	ЧтениеXML 				= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПолученныеДанные);
	
	Объект_distributors		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,Тип_distributors);
	Если Объект_distributors.auth.result	= "ok" Тогда
		авторизацияВыполнена	= истина;
	КонецЕсли;
	                                                                                      
	Если Объект_distributors.groupsUnlink						<> Неопределено Тогда
		ТЗ	= СтоСПОбмен_Общий.ТЗ_поСпискуXDTO(Объект_distributors.groupsUnlink.group);
		стр_Результат.Вставить("groupsUnlink",ТЗ);
	КонецЕсли;

	стр_Результат.Вставить("авторизацияВыполнена",авторизацияВыполнена);
	Возврат стр_Результат;	
	
КонецФункции

#КонецОбласти


#Область ОтправитьВыдачуЗаказов
Процедура Отправить_ВыдачуЗаказов(ДокументКД) Экспорт
	Если не ДокументКД.СвойКурьер Тогда возврат; КонецЕсли;
	
	ЕстьЗаказыКОтправке = ДокументКД.ЗаказыНаСкладе.НайтиСтроки(новый Структура("Подбор",Истина)).Количество()>0;
	Если ЕстьЗаказыКОтправке и не ДокументКД.ОтправленаВыдача Тогда
		Отправили 			= ТекстЗапроса_ВыдачаЗаказа(ДокументКД);
		Получили			= ОтправитьНаСайт(Отправили, ДокументКД.Ссылка,"Выдача заказов");
		АнализОтвета		= АнализОтвета_ВыдачаЗаказов(Получили.ПолученныеДанные);
		Если не АнализОтвета.авторизацияВыполнена Тогда Возврат; КонецЕсли;
		Для Каждого элем из АнализОтвета.deliveries Цикл
			ТекущаяПосылка = СП_РаботаСоСправочниками.ПолучитьПосылкуПо_Коду(элем.PackageId);
			найденыеЗаказы = ДокументКД.ЗаказыНаскладе.НайтиСтроки(новый Структура("Посылка, Подбор",ТекущаяПосылка, Истина));
			Для каждого Заказ из найденыеЗаказы Цикл
				Если Элем.result = "ap" или Элем.result = "ok" Тогда
					Заказ.Отправлено 	= Истина;
				ИначеЕсли Элем.result = "error" Тогда
					Заказ.Отправлено 	= Ложь;
					Заказ.Сообщение		= Элем.message; 
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ДокументКД.ОтправленаВыдача = Истина;
	КонецЕсли;
КонецПроцедуры	

Функция АнализОтвета_ВыдачаЗаказов(ПолученныеДанные)
	стр_Результат			= Новый Структура;

	пространствоИмен		= "http://www.100sp.ru/api/distributor/upload/back";
	авторизацияВыполнена	= ложь;
	Тип_distributors		= ФабрикаXDTO.Тип(пространствоИмен, "distributors");
		
	ПолученныеДанные		= СтрЗаменить(ПолученныеДанные, "http://www.100sp.ru","http://www.100sp.ru/api/distributor/upload/back");
	ЧтениеXML 				= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПолученныеДанные);
	
	Объект_distributors		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,Тип_distributors);
	Если Объект_distributors.auth.result	= "ok" Тогда
		авторизацияВыполнена	= истина;
	КонецЕсли;
	                                                                                      
	Если Объект_distributors.deliveries						<> Неопределено Тогда
		ТЗ	= СтоСПОбмен_Общий.ТЗ_поСпискуXDTO(Объект_distributors.deliveries.delivery);
		стр_Результат.Вставить("deliveries",ТЗ);
	КонецЕсли;

	стр_Результат.Вставить("авторизацияВыполнена",авторизацияВыполнена);
	Возврат стр_Результат;	
	
КонецФункции

Функция ТекстЗапроса_ВыдачаЗаказа(ДокументКД) 
	ЗаписьXML=Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьНачалоЭлемента("distributors");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd", "http://www.w3.org/2001/XMLSchema");

	СписокЗаказовКВыдаче	= ДокументКД.ЗаказыНаСкладе.НайтиСтроки(Новый Структура("Подбор", Истина ));
	ЗаписьXML.ЗаписатьНачалоЭлемента("deliveries");
	 Для каждого стр из СписокЗаказовКВыдаче Цикл 
		ЗаписьXML.ЗаписатьНачалоЭлемента("delivery");
			 
			 СтоСП.Вставить_Тэг(ЗаписьXML,"arrivalNumber"	, 	Прав(ДокументКД.Номер,6));
			 СтоСП.Вставить_Тэг(ЗаписьXML,"date"	, 			ДокументКД.Дата);
			 СтоСП.Вставить_Тэг(ЗаписьXML,"paidSum"	, 			Формат(стр.СтоимостьИтого - стр.ОплачиваетОрганизатор,		"ЧГ=0"));
	         Если Стр.ОплачиваетОрганизатор>0 Тогда
				СтоСП.Вставить_Тэг(ЗаписьXML,"paidSumOrg",			Формат(Стр.ОплачиваетОрганизатор,	"ЧГ=0"));
			 КонецЕсли;	
			 	
			 СтоСП.Вставить_Тэг(ЗаписьXML,"packageId"	, 			Формат(стр.Посылка.Код,"ЧГ=0;"));
			 СтоСП.Вставить_Тэг(ЗаписьXML,"orderType"	, 			"package");
			 СтоСП.Вставить_Тэг(ЗаписьXML,"isSpCourier"	, 			1);
			 
		 ЗаписьXML.ЗаписатьКонецЭлемента();
		 		 
		 
	 КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ОтправленныеДанные = ЗаписьXML.Закрыть();
	ОтправленныеДанные = СтрЗаменить(ОтправленныеДанные, "xmlns=""http://www.100sp.ru/XMLSchema-instance"" ", "");
	Возврат ОтправленныеДанные;
КонецФункции
#КонецОбласти





Функция ТекстЗапроса_Счет_Api(ДокументКД)	Экспорт
	 ЗаписьXML=новый ЗаписьXML;
	 ЗаписьXML.УстановитьСтроку("UTF-8");
	 ЗаписьXML.ЗаписатьНачалоЭлемента("distributors");
	 
	 ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi","http://www.w3.org/2001/XMLSchema-instance");
	 ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd","http://www.w3.org/2001/XMLSchema");
	 	
	 
		 ЗаписьXML.ЗаписатьНачалоЭлемента("groupsBill");
			 ЗаписьXML.ЗаписатьНачалоЭлемента("group");
			 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("delivery_group_id");
				 	ЗаписьXML.ЗаписатьТекст(ДокументКД.номер);
				 ЗаписьXML.ЗаписатьКонецЭлемента();
				 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("weight");
				 	ЗаписьXML.ЗаписатьТекст(Формат(0,"ЧГ=0"));
				 ЗаписьXML.ЗаписатьКонецЭлемента();
				 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("width");
				 	ЗаписьXML.ЗаписатьТекст(Формат(0,"ЧГ=0"));
				 ЗаписьXML.ЗаписатьКонецЭлемента();
				 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("height");
				 	ЗаписьXML.ЗаписатьТекст(Формат(0,"ЧГ=0"));
				 ЗаписьXML.ЗаписатьКонецЭлемента();
	 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("length");
				 	ЗаписьXML.ЗаписатьТекст(Формат(0,"ЧГ=0"));
				 ЗаписьXML.ЗаписатьКонецЭлемента();
	 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("prepay_price");
				 	ЗаписьXML.ЗаписатьТекст(Формат(ДокументКД.СтоимостьДоставки,"ЧДЦ=2; ЧГ=0"));
				 ЗаписьXML.ЗаписатьКонецЭлемента();
	 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("cod_price");
				 	ЗаписьXML.ЗаписатьТекст(Формат(ДокументКД.СтоимостьДоставки,"ЧДЦ=2; ЧГ=0"));
				 ЗаписьXML.ЗаписатьКонецЭлемента();
				 
				 ЗаписьXML.ЗаписатьНачалоЭлемента("bill_date");
				 	ЗаписьXML.ЗаписатьТекст(Строка(ДокументКД.Дата));
				 ЗаписьXML.ЗаписатьКонецЭлемента();
				 
			 ЗаписьXML.ЗаписатьКонецЭлемента();
		 ЗаписьXML.ЗаписатьКонецЭлемента();		 
		 

	 ЗаписьXML.ЗаписатьКонецЭлемента();	
	ТекстЗапроса = ЗаписьXML.Закрыть();	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"xmlns=""http://www.100sp.ru/XMLSchema-instance"" ","");
	Возврат ТекстЗапроса;	
КонецФункции	

Функция Статистика() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КурьерскаяДоставка.Статус,
		|	СУММА(1) КАК КоличествоЗаказов
		|ИЗ
		|	Документ.КурьерскаяДоставка КАК КурьерскаяДоставка
		|ГДЕ
		|		КурьерскаяДоставка.СтатусДоставки <> ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.Отправлен)
		|	 и 	КурьерскаяДоставка.СтатусДоставки <> ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.Отменен)
		|СГРУППИРОВАТЬ ПО
		|	КурьерскаяДоставка.Статус";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Результат = новый структура;
	
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.статус.имя,ВыборкаДетальныеЗаписи.количествоЗаказов);	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	


Функция 	ПолученныеДанные(ДанныеXML,Выгрузка=Ложь) 
	Параметры    = новый Структура;
	Параметры.Вставить("token",Константы.Токен.Получить());
	Параметры.Вставить("xml", ДанныеXML);
	Если Выгрузка Тогда
		АдресСкрипта = Константы.АдресВыгрузкиНасайт.Получить();
	Иначе	
		АдресСкрипта = Константы.АдресЗагрузкиССайта.Получить();
	КОнецЕсли;	

	ПолученныйФайл		= СтоСПОбмен_Общий.ПолучитьПостЗапросом(Параметры,АдресСкрипта);
	Если ПолученныйФайл	= Неопределено Тогда Возврат "Не удалось соеденится с сайтом"; КонецЕсли; 
	ПолученныеДанные	= СтоСПОбмен_Общий.ФайлВСтроку(ПолученныйФайл);
	Возврат ПолученныеДанные;
КонецФункции


Функция ОтправитьНаСайт(Отправили, Ссылка, Описание) 
	СтрокаПротокола						= 	новый Структура ("ДатаНачала, ДатаОкончания,Описание, Отправили, Результат, ПолученныеДанные");
	СтрокаПротокола.Отправили			= 	Отправили;
	СтрокаПротокола.ДатаНачала			=	ТекущаяДата();
	СтрокаПротокола.Описание			=	Описание;
	
	АдресСкрипта 		= Константы.АдресВыгрузкиНасайт.Получить();
	Параметры    		= новый Структура;
	Параметры.Вставить("token",	Константы.Токен.Получить());
	Параметры.Вставить("xml", 	Отправили);
	
	ПолученныйФайл		= СтоСПОбмен_Общий.ПолучитьПостЗапросом(Параметры,АдресСкрипта);
	
	Если ПолученныйФайл	= Неопределено Тогда 		
		СтрокаПротокола.Результат		= Ложь; 
		СтрокаПротокола.ДатаОкончания	= ТекущаяДата();
		Возврат СтрокаПротокола;	
	КонецЕсли; 
	Если аспПроцедурыОбменаДанными.АвторизацияВыполнена(ПолученныйФайл) Тогда
		СтрокаПротокола.Результат= Истина;
		СтрокаПротокола.ПолученныеДанные	=  СтоСПОбмен_Общий.ФайлВСтроку(ПолученныйФайл);
	Иначе
		СтрокаПротокола.ПолученныеДанные	= "Авторизация не выполнена" + СтоСПОбмен_Общий.ФайлВСтроку(ПолученныйФайл);
	КонецЕсли;	
	СтрокаПротокола.ДатаОкончания			= ТекущаяДата();
	СтоСПОбмен_Выгрузка100сп.СохранитьПротоколОбмена(СтрокаПротокола,Ссылка);
	Возврат СтрокаПротокола;
КонецФункции


Функция Разбор_Доставки(ПолученныеДанные) 
	ПолученныеДанные 		= СтрЗаменить(ПолученныеДанные,"uid=""""","uid=""0""");
	ПолученныеДанные 		= СтрЗаменить(ПолученныеДанные,"<firstPid></firstPid>","<firstPid>0</firstPid>");
	ПолученныеДанные 		= СтрЗаменить(ПолученныеДанные,"<date_range_limit></date_range_limit>","<date_range_limit>0</date_range_limit>");
	ПолученныеДанные 		= СтрЗаменить(ПолученныеДанные,"<date_range_limit/>","<date_range_limit>0</date_range_limit>");

	стр_Результат			= Новый Структура;

	пространствоИмен		= "http://www.100sp.ru/api/distributor/upload/back";
	авторизацияВыполнена	= ложь;
	Тип_distributors		= ФабрикаXDTO.Тип(пространствоИмен, "distributors");
		
	ПолученныеДанные		= СтрЗаменить(ПолученныеДанные, "http://www.100sp.ru","http://www.100sp.ru/api/distributor/upload/back");
	ЧтениеXML 				= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПолученныеДанные);
	
	Объект_distributors		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,Тип_distributors);
	Если Объект_distributors.auth.result	= "ok" Тогда
		авторизацияВыполнена	= истина;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат ложь;
	КонецЕсли;
	                                                                                      
	Если Объект_distributors.deliveryGroups						<> Неопределено Тогда
		ТЗ	= СтоСПОбмен_Общий.ТЗ_поСпискуXDTO(Объект_distributors.deliveryGroups.deliveryGroup);
		стр_Результат.Вставить("deliveryGroups",ТЗ);
	ИначеЕсли Объект_distributors.dataByDates.deliveryGroups	<> Неопределено Тогда
		ТЗ	= СтоСПОбмен_Общий.ТЗ_поСпискуXDTO(Объект_distributors.dataByDates.deliveryGroups.deliveryGroup);
		стр_Результат.Вставить("deliveryGroups",ТЗ);
	КонецЕсли;

	стр_Результат.Вставить("авторизацияВыполнена",авторизацияВыполнена);
	Возврат стр_Результат;

КонецФункции
